In [1]:
import pandas as pd
import numpy as np

In [2]:
d1 = {'col1': [1, 2], 'col2': [3, 4]}
df1 = pd.DataFrame(data=d1)
df1

   col1  col2
0     1     3
1     2     4

In [3]:
df1_transposed = df1.T # or df1.transpose()
df1_transposed

      0  1
col1  1  2
col2  3  4

In [4]:
df1.dtypes

col1    int64
col2    int64
dtype: object

In [5]:
df1_transposed.dtypes

0    int64
1    int64
dtype: object

In [6]:
df1_transposed.dtypes

0    int64
1    int64
dtype: object

In [7]:
d2 = {'name': ['Alice', 'Bob'],
      'score': [9.5, 8],
      'employed': [False, True],
      'kids': [0, 0]}
df2 = pd.DataFrame(data=d2)
df2

    name  score  employed  kids
0  Alice    9.5     False     0
1    Bob    8.0      True     0

In [8]:
df2_transposed = df2.T # or df2.transpose()
df2_transposed

              0     1
name      Alice   Bob
score       9.5     8
employed  False  True
kids          0     0

In [9]:
df2.dtypes

name         object
score       float64
employed       bool
kids          int64
dtype: object

In [10]:
df2_transposed.dtypes

0    object
1    object
dtype: object